{
    "quest": {
        "name": "Allergic to Sunshine",
        "location": "Limsa Lominsa",
        "id": 70259,
        "patch": 6.3,
        "sort": 222,
        "icon": 101233,
        "eventIcon": 71221,
        "issuer": 1045005,
        "target": 1045009,
        "genre": 201,
        "journal": [
            "Mayaru Moyaru is calling all adventurers to join in on the hottest event of the year.<br>※This quest is available for a limited time only.",
            "Eorzea bakes under the sun like an egg over a hot flame, and during such times it fall upon the Adventurers' Guild to offer the realm succor through merriment in the form of the Moonfire Faire. Mayaru Moyaru informs you that in addition to the highly-acclaimed Nimble Warrior course, the festivities are being guarded by a brave hero called the Sunshine Savior. However, there are always more hands needed at Costa Del Sol, and she encourages you to report to Haermaga if the spirit of volunteering stirs within your core.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.",
            "As a fellow member of the guild, Haermaga welcomes you with slightly more open arms than the common festival-goer. Almost immediately he asks for your help in solving a pressing issue with the fledgling Sunshine Savior. A young man named Reeve was recruited for the role, and Haermaga asks that you lift his flagging spirits with some adventurous encouragement. You agree, and Haermaga heads toward the aetheryte, eager to make introductions.",
            "The future guardian of Costa Del Sol makes an awkward first impression, revealing that the source of his distress is an aversion to having his face exposed to prying eyes. Haermaga does not skip a beat, however, and seems to have a potential solution to the problem at the ready. He asks you to meet him at the guild's base, but remains coy on the details of what awaits you there.",
            "You arrive at the guild's tent to see Reeve bedecked in a garish costume, the design of which was apparently commissioned by Haermaga himself─a fact that apparently makes the chaperone quite proud. Regardless of the outfit's tastefulness, it seems to have restored Reeve's confidence, and the young man stands ready to protect the Moonfire Faire's revelers.",
            "Reeve's spirits have been restored, and he is eager to prove himself worthy of the title Sunshine Savior. However, he acknowledges that he yet has much to learn, and asks that you assist him until he can stand on his own two feet as the beach's protector. If previous Moonfire Faires are any indicator, it will not be long until you are needed."
        ],
        "objectives": [
            "Speak with Haermaga in Costa Del Sol.",
            "Speak with Haermaga again.",
            "Wait at the designated location.",
            "Speak with Reeve."
        ],
        "dialogue": [
            {
                "name": "MAYARUMOYARU",
                "text": "Ah, my prayers are answered! As the sun beat down upon my brow, my flagging spirits were kept aloft by the hope of your return. Now that you're here, I can say that the Moonfire Faire's success is assured!"
            },
            {
                "name": "MAYARUMOYARU",
                "text": "Come one, come all! The Moonfire Faire is here to offer the realm's beleaguered citizens a diversion from the sun's scorching rays, and seeks volunteers from among the Adventurers' Guild's ranks to ensure a summer worth remembering!"
            },
            {
                "name": "MAYARUMOYARU",
                "text": "Yes, a festival with a long and storied history that hardly bears repeating, but for all intents and purposes has become the premiere event of our guild. We hope to stoke the fires of adventurous hearts young, old, and all ages in between!"
            },
            {
                "name": "MAYARUMOYARU",
                "text": "This season's main event has become a fast favorite among adventurers and revelers alike: the Eorzean Nimble Warrior course! Keeping vigil over the proceedings are the Sunshine Saviors, guardians of the sandy beaches!"
            },
            {
                "name": "MAYARUMOYARU",
                "text": "Who are the Sunshine Saviors, you say? Well, if your interest has been piqued, then I encourage you to make haste to Costa Del Sol, where Haermaga stands at the ready to apprise eager volunteers of the details! "
            },
            {
                "name": "MAYARUMOYARU",
                "text": "Haermaga awaits to induct any eager volunteers for this year's Moonfire Faire festivities. Attend to him and you, too, may even be fortunate enough to meet the fabled Sunshine Saviors!"
            },
            {
                "name": "HAERMAGA",
                "text": "Well, if it isn't <span class=\"highlight\">Forename</span>, as constant a guest to the Moonfire Faire as this stifling heat! Did Mayaru Moyaru's mention of the Sunshine Saviors stir that heroic spirit of yours?"
            },
            {
                "name": "HAERMAGA",
                "text": "Welcome to the Moonfire Faire! It's always a treat to see a new face, and one from the guild doubly so. Did Mayaru Moyaru's mention of the Sunshine Saviors stir the spirit of heroism within you?"
            },
            {
                "name": "HAERMAGA",
                "text": "Well, sorry to put a damper on your enthusiasm, but I've hit a bit of a snag in the matter. Luckily, fate has brought me a kindred spirit─one who wouldn't mind lending an ear to my troubles, perhaps?"
            },
            {
                "name": "HAERMAGA",
                "text": "Much obliged. You see, the faire has had its share of troubles since its inception, and make no mistake. People swimming where they shouldn't be, monsters barging in like its a bloody feast, and so on and so forth."
            },
            {
                "name": "HAERMAGA",
                "text": "To combat this I've decided to look for what I call a Sunshine Savior, a brave soul whose duty would be to nip such problems in the bud before they become everyone's headache."
            },
            {
                "name": "HAERMAGA",
                "text": "Not only would they keep our patrons safe, but their deeds would increase the esteem of the guild as well. Yet as much as I would've liked to helm this band myself, my other duties keep me from the bolder acts of heroics."
            },
            {
                "name": "HAERMAGA",
                "text": "So I went looking for a stout arm from within our ranks, and after a process of stringent vetting, found an eager youth by the name of Reeve."
            },
            {
                "name": "HAERMAGA",
                "text": "While gifted with a strong sense of compassion for others, his spirits seem to have taken a sharp dive since he arrived in Costa Del Sol. At first I though the heat might disagree with him, but it's become plain something else is at work."
            },
            {
                "name": "HAERMAGA",
                "text": "So, assuming you have the time and the inclination, I'd like you to give him a bit of the old adventurers' wisdom, make him the leader I know he can be. Once that's all sorted, you'll be free to do as you please─not that you couldn't do that anyways. How about it, then?"
            },
            {
                "name": "HAERMAGA",
                "text": "Good, good. Now then, follow me and I'll make introductions. Reeve should be somewhere near the aetheryte─let's go find him, eh?"
            },
            {
                "name": "HAERMAGA",
                "text": "Apologies, but the lad seems to be missing. I doubt he's gone far, though, considering his temperament..."
            },
            {
                "name": "MOB",
                "text": "(-Surly Man-)Get yer bloody hands off of my goods!"
            },
            {
                "name": "REEVE",
                "text": "(-Tremulous Youth-)S-s-sorry, terribly sorry! I only thought to help... The crates looked terribly heavy, you see..."
            },
            {
                "name": "REEVE",
                "text": "(-Tremulous Youth-)B-but you're right to be wroth at me! Yes, for why would you need <span class=\"emphasis\">my</span> aid, with my arms thinner than sprouting reeds... I see the error of my ways. I shall shovel buffalo dung as punishment!"
            },
            {
                "name": "MOB",
                "text": "Ah, lad, sorry for snappin' at ye. Appreciate the thought, but the contents of these crates are my livelihood─can't trust just any passersby with their safe carriage, ye understand."
            },
            {
                "name": "MOB",
                "text": "And truth be told, you came at me like a chocobo takin' its first steps into the world. You need to strut with a bit o' confidence if you don't want people lookin' at you crosswise, see? "
            },
            {
                "name": "MOB",
                "text": "Ye've got a good heart, I can tell, so work on yer manner and I reckon yer next attempt at charity will go better. Anyroad, work is callin'─hope to be seein' you around. "
            },
            {
                "name": "HAERMAGA",
                "text": "Hmm. I gathered the gist of what happened, but I'd like to hear your side of the story. Mind filling me in, lad?"
            },
            {
                "name": "REEVE",
                "text": "Oh, Master Haermaga! And who is this...? It's can't be... Is this <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> my replacement!? Heavens forfend, I've been dismissed before my duty has even begun."
            },
            {
                "name": "REEVE",
                "text": "ハッ……もしや、ふがいない俺に嫌気が差して代役を……<br>俺、まさかの活動前にクビ……！？"
            },
            {
                "name": "HAERMAGA",
                "text": "There's no need for all that. <span class=\"highlight\">Forename</span> here is a member of the guild, and <span class=\"alternative-container\"><span class=\"alternative\">she's</span><span class=\"alternative\">he's</span></span> here to help. But first, we need to know what's going on."
            },
            {
                "name": "REEVE",
                "text": "I, ah... Well, you see, I was awaiting orders like I was supposed to, but that man caught my eye. He seemed to be having some difficulty, and I saw no harm in offering help, but...you saw how the rest went."
            },
            {
                "name": "HAERMAGA",
                "text": "...Well, I can't fault you for trying to do good, lad, but what he said was right: you're manner is strange, and has been ever since you set foot on these sands. I don't recall you being so timid when first we met─if something's eating at you, we're here to listen.  "
            },
            {
                "name": "REEVE",
                "text": "You're...too kind..."
            },
            {
                "name": "REEVE",
                "text": "The truth is...I just can't bear to have my face seen by others. All those eyes on me...it's dreadful. Under a helmet, I have the confidence of a captain, but this heat has made such a prospect impossible."
            },
            {
                "name": "REEVE",
                "text": "As I am, I'm liable to do more harm than help. The festivities are due to start any moment, and if I can't get past this fear of mine, I don't know what I'll do..."
            },
            {
                "name": "HAERMAGA",
                "text": "So that's how it is, eh? That more or less answers all my questions, so we can get right to figuring out a solution to this little problem of ours."
            },
            {
                "name": "HAERMAGA",
                "text": "If it's as simple as hiding your face, I think I have just what you need. Mind coming to meet me at the guild tents? We'll have you fit for derring-do in the blink of an eye!  "
            },
            {
                "name": "HAERMAGA",
                "text": "As for you, <span class=\"highlight\">Forename</span>, you'd better wait on the beach for our return. We'll be back before you can break a sweat."
            },
            {
                "name": "HAERMAGA",
                "text": "And here we are!"
            },
            {
                "name": "HAERMAGA",
                "text": "Now that's the reaction I  like to see! I had this lovely piece made the moment I conceived of the Sunshine Savior. A special commission from the Weavers' Guild!"
            },
            {
                "name": "HAERMAGA",
                "text": "But genius isn't always obvious, as I found out. My colleagues claimed the coloring was too bold, the design too daring. I believe the word “gaudy” was used. And so, with a heavy heart, I set it aside─until today, that is. This'll hide your face and then some, I reckon."
            },
            {
                "name": "REEVE",
                "text": "By the gods, I feel a whole fulm taller! The fabric is so light it feels as if I'm wearing naught but my nameday suit, but my face is hidden from the world! This is just what I needed to become the Sunshine Savior!"
            },
            {
                "name": "HAERMAGA",
                "text": "Masks are usually for hiding one's true nature, but this is the Reeve I remember. If you ask me, he looks the spitting image of a hero. But what do you think, <span class=\"highlight\">Forename</span>?"
            },
            {
                "name": "Q1",
                "text": "What will you say?"
            },
            {
                "name": "A1",
                "text": "It certainly suits him."
            },
            {
                "name": "A1",
                "text": "I'm not sure if this is an improvement."
            },
            {
                "name": "A1",
                "text": "Is he meant to carry to torch of the Go Go Posing Rangers?"
            },
            {
                "name": "REEVE",
                "text": "I'm overjoyed that you think so! Mark my words, the sands of Costa Del Sol shall remain safe under the watchful eyes of the Sunshine Savior!"
            },
            {
                "name": "REEVE",
                "text": "Really? I'm quite taken with it─particularly with the creative use of feathers. With this, festival-goers can rest assured that they shall be safe under the watchful eyes of the Sunshine Savior!"
            },
            {
                "name": "HAERMAGA",
                "text": "So you remember that, eh? Truth be told, the thought hadn't crossed my mind when designing the costume, but now that you mention it..."
            },
            {
                "name": "REEVE",
                "text": "Ah, the Go Go Posing Rangers, I know their story well! Those dauntless heroes pitted themselves against the Bombards for the safety of the realm!"
            },
            {
                "name": "REEVE",
                "text": "And as the flames of the Bombards were extinguished, the Rangers disappeared like a distant mirage. Hearing how they risked life and limb, with no expectation of reward or fame, inspired me to become the person I am today!"
            },
            {
                "name": "HAERMAGA",
                "text": "Is that so? It warms my heart to know they left such a lasting impression on at least one young mind."
            },
            {
                "name": "HAERMAGA",
                "text": "Now then, Reeve, consider this your official appointment as the Sunshine Savior. Go forth, and remember that you carry the reputation of the Adventurers' Guild on your shoulders. Don't crumble under the weight, lad."
            },
            {
                "name": "HAERMAGA",
                "text": "Become a savior worthy of your namesake, and our guests will forget altogether the monsters and maladies that plague them on a daily basis! I know you won't disappoint!"
            },
            {
                "name": "REEVE",
                "text": "Thank you, Master Haermaga!"
            },
            {
                "name": "HAERMAGA",
                "text": "Reeve has a gods-honest chance to make a good run of it now, but that depends on him..."
            },
            {
                "name": "REEVE",
                "text": "I'm the Sunshine Savior, and must bear all the responsibilities that the title implies. If I succeed, I may very well be the kind of adventurer that others tell tales of! "
            },
            {
                "name": "REEVE",
                "text": "By the way, I'd like to apologize for my embarrassing conduct before..."
            },
            {
                "name": "REEVE",
                "text": "I admit a part of me is scared almost all of the time, but I can't let that dictate my life and my duty. Whatever happens, I swear to do all in my power to make the Moonfire Faire into the most pleasant place in Eorzea!"
            },
            {
                "name": "REEVE",
                "text": "That being said, I realize I still have much to learn, and would very much appreciate the help of a seasoned adventurer such as yourself. Can I count on it?"
            },
            {
                "name": "REEVE",
                "text": "Thank you, <span class=\"highlight\">Forename</span>! May we meet again soon!"
            }
        ],
        "reward": {
            "gil": 673
        },
        "reqs": {
            "jobs": [
                {
                    "lvl": 30,
                    "id": 1
                }
            ]
        },
        "next": [
            70260
        ]
    },
    "partials": [
        {
            "type": "npc",
            "id": "1045005",
            "obj": {
                "i": 1045005,
                "n": "Mayaru Moyaru",
                "l": 28,
                "q": 1,
                "t": "Moonfire Faire Chaperone"
            }
        },
        {
            "type": "npc",
            "id": "1045009",
            "obj": {
                "i": 1045009,
                "n": "Reeve",
                "l": 32,
                "q": 1
            }
        },
        {
            "type": "quest",
            "id": "70260",
            "obj": {
                "i": 70260,
                "n": "I am the Sunshine",
                "g": 201,
                "l": "Eastern La Noscea",
                "s": 223
            }
        }
    ]
}